app/views/listings/_form.html.erb

    <%= f.label :category_id %><br>
    <%= f.collection_select :category_id, Category.all, :id, :name, {prompt: "Choose a category"}, {class: "btn btn-default dropdown toggle"} %>
---
SELECT "categories".* FROM "categories"