app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-05 23:19:34.463674"], ["name", "Bikes"], ["updated_at", "2014-11-05 23:19:34.463674"]]
---
  def create
    @category = Category.new(category_params)
    @category.save