app/controllers/home_controller.rb

  def search
  	 @listings = Listing.where("city =? or country =?",params[:search],params[:search])
---
SELECT "listings".* FROM "listings"  WHERE (city ='London, United Kingdom' or country ='London, United Kingdom')