app/controllers/listings_controller.rb

INSERT INTO "notifications" ("approval_status", "created_at", "listing_id", "message", "receiver_id", "sender_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def accept_request
    @notification.update_attributes(:status=>"read",:approval_status=>"accepted")
    @new_notification = Notification.create(:message=>"#{@sender.name} has accepted your request for borrowing your gears name #{@listing.name}",:sender_id=>@sender.id,:receiver_id=>@receiver.id,:listing_id=>params[:listing_id],:approval_status=>"accepted")

INSERT INTO "notifications" ("approval_status", "created_at", "listing_id", "message", "receiver_id", "sender_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def reject_request
    @notification.update_attributes(:status=>"read",:approval_status=>"rejected")
    @new_notification = Notification.create(:message=>"#{@sender.name} has rejected your request for borrowing your gears name #{@listing.name}",:sender_id=>@sender.id,:receiver_id=>@receiver.id,:listing_id=>params[:listing_id],:approval_status=>"rejected")