app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"  WHERE "listings"."user_id" = 1  ORDER BY created_at DESC
SELECT "notifications".* FROM "notifications"  WHERE "notifications"."receiver_id" = ? AND (status ='unread')  [["receiver_id", 9]]
---
  def seller
    # @listings = Listing.where(user: current_user).order("created_at DESC")
    @reservation_listings = Listing.joins(:notifications).where("notifications.receiver_id=? and user_id=? and notifications.approval_status=?",current_user.id,current_user.id,"accepted")
    # @listing_notifications = current_user.sent_notifications.where("approval_status =?","accepted")
    @notifications = current_user.received_notifications.where("status =?","unread")

SELECT "categories".* FROM "categories"
SELECT "listings".* FROM "listings"   ORDER BY created_at DESC
SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'Bikes' LIMIT 1
SELECT "listings".* FROM "listings"  WHERE "listings"."category_id" = 1  ORDER BY created_at DESC
---
  def index
    if params[:category].blank?
      @listings = Listing.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @listings = Listing.where(category_id: @category_id).order("created_at DESC")

SELECT  "notifications".* FROM "notifications"  WHERE "notifications"."sender_id" = 11 AND "notifications"."listing_id" = 24 LIMIT 1
---
  def show

    @notification = Notification.find_by_sender_id_and_listing_id(current_user.id,@listing.id) if user_signed_in?

INSERT INTO "listings" ("address", "category_id", "city", "country", "created_at", "description", "end_date", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "postcode", "price", "start_date", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    # if current_user.recipient.blank?
    #   Stripe.api_key = ENV["STRIPE_API_KEY"]
    #   token = params[:stripeToken]

      # recipient = Stripe::Recipient.create(
      #   :name => current_user.name,
      #   :type => "individual",
      #   :bank_account => token
      #   )

    #   current_user.recipient = recipient.id
    #   current_user.save
    # end



    respond_to do |format|
      if @listing.save

SELECT  "notifications".* FROM "notifications"  WHERE "notifications"."sender_id" = 9 AND "notifications"."listing_id" = 24 LIMIT 1
INSERT INTO "notifications" ("created_at", "listing_id", "message", "receiver_id", "sender_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def send_notification
    @sender = current_user
    @receiver = @listing.user
    @notification = Notification.find_by_sender_id_and_listing_id(@sender.id,@listing.id)
    unless @sender.id == @receiver.id && @notification
      UserMailer.borrowing_notification(@listing)
      @notification = Notification.create(:message=>"#{@sender.name} is interested in borrowing your gears",:sender_id=>@sender.id,:receiver_id=>@receiver.id,:listing_id=>@listing.id)

UPDATE "notifications" SET "approval_status" = ?, "status" = ?, "updated_at" = ? WHERE "notifications"."id" = 1  [["approval_status", "accepted"], ["status", "read"], ["updated_at", "2014-12-01 22:58:03.816280"]]
---
  def accept_request
    @notification.update_attributes(:status=>"read",:approval_status=>"accepted",:message=>"#{@sender.name} has accepted your request for borrowing your gears name")

UPDATE "notifications" SET "approval_status" = ?, "status" = ?, "updated_at" = ? WHERE "notifications"."id" = 9  [["approval_status", "rejected"], ["status", "read"], ["updated_at", "2014-12-10 23:13:57.774279"]]
---
  def reject_request
    @notification.update_attributes(:status=>"read",:approval_status=>"rejected",:message=>"#{@sender.name} has rejected your request for borrowing your gears name")

SELECT  "notifications".* FROM "notifications"  WHERE "notifications"."id" = ? LIMIT 1  [["id", 9]]
---
    def set_notification
     @notification = Notification.find(params[:notification_id])