app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"  WHERE "orders"."seller_id" = 9  ORDER BY created_at DESC
---
  def sales
    @orders = Order.all.where(seller: current_user).order("created_at DESC")

SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 7]]
---
  def create
    @order = Order.new(order_params)
    @listing = Listing.find(params[:listing_id])

INSERT INTO "orders" ("address", "buyer_id", "city", "created_at", "listing_id", "seller_id", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
# Create Payment and return the status(true or false)

    if @payment.create
      @order.save